Revit 2024 API
ViewSystemsAnalysisReport Class
 Represents a report instance of the systems analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public class ViewSystemsAnalysisReport : View
Visual Basic
Public Class ViewSystemsAnalysisReport _
	Inherits View
Visual C++
public ref class ViewSystemsAnalysisReport : public View
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport
See Also
ViewSystemsAnalysisReport Members
Autodesk.Revit.DB.Analysis Namespace